In [67]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [80]:
first_df = pd.read_csv("C:/Users/js2-3/Desktop/data2/전국_평균_분양가격(2013년_9월부터_2015년_8월까지).csv", encoding='cp949')
first_df.head(5)

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
0,서울,18189,17925,17925,18016,18098,19446,18867,18742,19274,...,20242,20269,20670,20670,19415,18842,18367,18374,18152,18443
1,부산,8111,8111,9078,8965,9402,9501,9453,9457,9411,...,9208,9208,9204,9235,9279,9327,9345,9515,9559,9581
2,대구,8080,8080,8077,8101,8267,8274,8360,8360,8370,...,8439,8253,8327,8416,8441,8446,8568,8542,8542,8795
3,인천,10204,10204,10408,10408,10000,9844,10058,9974,9973,...,10020,10020,10017,9876,9876,9938,10551,10443,10443,10449
4,광주,6098,7326,7611,7346,7346,7523,7659,7612,7622,...,7752,7748,7752,7756,7861,7914,7877,7881,8089,8231

In [81]:
last_df = pd.read_csv("C:/Users/js2-3/Desktop/data2/주택도시보증공사_전국_평균_분양가격(2019년_12월).csv", encoding='cp949')
last_df.head(5)

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [82]:
# 파일 내에 있는 null 값의 개수 확인ㄴ
last_df.isna().sum()

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    277
dtype: int64

In [83]:
last_df['분양가격'] = pd.to_numeric(last_df['분양가격(㎡)'], errors='coerce')
last_df['분양가격'].astype('Float64')

0       5841.0
1       5652.0
2       5882.0
3       5721.0
4       5879.0
         ...
4330    3882.0
4331      <NA>
4332    3898.0
4333      <NA>
4334    3601.0
Name: 분양가격, Length: 4335, dtype: Float64

In [84]:
print(f"분양가격 합:\t{last_df['분양가격'].sum(): .0f}0000원")
print(f"분양가격 평균:\t{last_df['분양가격'].mean() : .0f}0000원")

분양가격 합:	 128132750000원
분양가격 평균:	 32380000원

In [85]:
last_df['평당분양가격'] = last_df['분양가격'] * 3.3

In [86]:
last_df

     지역명               규모구분    연도   월 분양가격(㎡)    분양가격   평당분양가격
0     서울                 전체  2015  10    5841  5841.0  19275.3
1     서울         전용면적 60㎡이하  2015  10    5652  5652.0  18651.6
2     서울   전용면적 60㎡초과 85㎡이하  2015  10    5882  5882.0  19410.6
3     서울  전용면적 85㎡초과 102㎡이하  2015  10    5721  5721.0  18879.3
4     서울        전용면적 102㎡초과  2015  10    5879  5879.0  19400.7
...   ..                ...   ...  ..     ...     ...      ...
4330  제주                 전체  2019  12    3882  3882.0  12810.6
4331  제주         전용면적 60㎡이하  2019  12     NaN     NaN      NaN
4332  제주   전용면적 60㎡초과 85㎡이하  2019  12    3898  3898.0  12863.4
4333  제주  전용면적 85㎡초과 102㎡이하  2019  12     NaN     NaN      NaN
4334  제주        전용면적 102㎡초과  2019  12    3601  3601.0  11883.3

[4335 rows x 7 columns]

In [87]:
# 특정 column의 값 종류(unique)와 그 개수(nunique)를 출력
last_df['규모구분'].unique(), last_df['규모구분'].nunique()

(array(['전체', '전용면적 60㎡이하', '전용면적 60㎡초과 85㎡이하', '전용면적 85㎡초과 102㎡이하',
        '전용면적 102㎡초과'], dtype=object),
 5)

In [88]:
#df['날짜'] = df['날짜'].str.replace('년', '-').str.replace('월', '-').str.replace('일', '')
last_df['규모구분'] = last_df['규모구분'].str.replace('전용면적', '').str.replace('초과', '~').str.replace('이하', '')
last_df

     지역명        규모구분    연도   월 분양가격(㎡)    분양가격   평당분양가격
0     서울          전체  2015  10    5841  5841.0  19275.3
1     서울         60㎡  2015  10    5652  5652.0  18651.6
2     서울    60㎡~ 85㎡  2015  10    5882  5882.0  19410.6
3     서울   85㎡~ 102㎡  2015  10    5721  5721.0  18879.3
4     서울       102㎡~  2015  10    5879  5879.0  19400.7
...   ..         ...   ...  ..     ...     ...      ...
4330  제주          전체  2019  12    3882  3882.0  12810.6
4331  제주         60㎡  2019  12     NaN     NaN      NaN
4332  제주    60㎡~ 85㎡  2019  12    3898  3898.0  12863.4
4333  제주   85㎡~ 102㎡  2019  12     NaN     NaN      NaN
4334  제주       102㎡~  2019  12    3601  3601.0  11883.3

[4335 rows x 7 columns]

In [89]:
last_df2 = last_df.drop('분양가격(㎡)', axis=1).drop('분양가격', axis=1)
last_df2

     지역명        규모구분    연도   월   평당분양가격
0     서울          전체  2015  10  19275.3
1     서울         60㎡  2015  10  18651.6
2     서울    60㎡~ 85㎡  2015  10  19410.6
3     서울   85㎡~ 102㎡  2015  10  18879.3
4     서울       102㎡~  2015  10  19400.7
...   ..         ...   ...  ..      ...
4330  제주          전체  2019  12  12810.6
4331  제주         60㎡  2019  12      NaN
4332  제주    60㎡~ 85㎡  2019  12  12863.4
4333  제주   85㎡~ 102㎡  2019  12      NaN
4334  제주       102㎡~  2019  12  11883.3

[4335 rows x 5 columns]